# def functionname():
    
    
#     print('here')
    
    
# if __name__ == '__main__':
#     input1 = input()
#     input2 = input()
#     inp_lst = list(map(int, input2.split(' ')))
#     functionname()

test = '1'
if test:
    print(test)


"""
*********************************************************************************
main
설명: input argument를 user로부터 받기위해 input함수를 사용해서 보드의 사이즈와 보드를
받음
*********************************************************************************
"""     

"""
********************************************************************************
함수 이름: checker
파라미터: 
fist : String - 체스판의 (1,1)의 색상
num : Integer - 체스판 8X8에서 행의 순서
stg : String - 체스판 각 행의 색을 표시한 문자열
반환값:
cnt : Integer - 문자열에서 바꿔야할 색의 수를 카운트해 더해준 값
설명: 체스판 행을 한줄 받아서 짝수와 홀수번째 문자를 각각 체크해 검정색과 흰색을 반복해서
나오게 하기위해 다시 칠해야할 정사각형의 개수를 세어주는 함수
*********************************************************************************
"""




 